{
  "projects": [
    {
      "title": "MERN Restaurant order App",
      "description": "A full-stack application that allows customers to book a table and provides an admin with a dynamic dashboard interface to manage reservations. The admin can interact with customer orders seamlessly, streamlining the entire booking and order management process.",
      "technologies": ["React", "Redux", "Tailwind", "NodeJS", "ExpressJS", "MongoDb", "JWT"],
      "giiHubRepoLink": "https://github.com/StefanHritcu/Progetto-Ristorante-Stack-MERN",
      "netlifyLink": "https://ristorantemern.netlify.app/"
    },
    {
      "title": "Weather API",
      "description": "An application to display weather forecasts based on real-time data obtained through the OpenWeather API, with the addition of extra information for activities.",
      "technologies": ["HTML", "CSS", "JavaScript", "React", "API"],
      "giiHubRepoLink": "https://github.com/StefanHritcu/WeatherApi",
      "netlifyLink": "https://weather-api-by-hritcu.netlify.app/"
    },
    {
      "title": "OpenSoundHub",
      "description": "A full-stack project developed in online collaboration with a backend programmer. I was responsible for the frontend development, focusing on building the website and tackling challenges related to the integration between the frontend and backend. I successfully overcame these challenges by understanding the type of data that needed to be exchanged between the frontend and backend, thanks to effective communication",
      "technologies": ["Semantic HTML", "SASS", "React"],
      "giiHubRepoLink": "https://github.com/StefanHritcu/OpenSoundHub-Collaborative-Full-Stack-Audio-Processing-Platform"
    },
    {
      "title": "Games",
      "description": "A website that includes a quick registration process and the ability to play Tic-Tac-Toe and Connect Four. The more you win, the higher you climb the leaderboard, with the goal of reaching the top.",
      "technologies": ["React", "Redux", "JavaScript"],
      "giiHubRepoLink": "https://github.com/StefanHritcu/Games-site-REACT",
      "netlifyLink": "https://stefanhritcu.github.io/Games-site-REACT/"
    }
  ]
}
